# Install via
# $ brew tap Homebrew/bundle
# $ brew bundle

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/versions'
tap 'homebrew/versions'

# This installs helper functions.
tap 'jbwhit/tap'
brew 'nb3automation'

brew 'bash'
brew 'bash-completion2'
brew 'awscli'
brew 'binutils'
brew 'cheat'
brew 'coreutils'
brew 'ctags'
brew 'diffutils'
brew 'file-formula'
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'git-extras'
brew 'htop'
brew 'hub'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls', args: ['with-default-names']
brew 'gpatch'
brew 'gpg'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'htop-osx'
brew 'hub'
brew 'jsonpp'
brew 'lastpass-cli', args: ['with-pinentry']
brew 'less'
brew 'm4'
brew 'make'
brew 'most'
brew 'openssh'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rsync'
brew 'screen'
brew 'ssh-copy-id'
brew 'svn'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'unzip'
brew 'vim', args: ['override-system-vi']
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget', args: ['with-iri']

cask 'iterm2'
cask 'sublime-text'
cask 'caffeine'
cask 'flux'
cask 'sourcetree'
cask 'google-chrome'
